Revit 2026 API

# AirSystemData Class

---

Represents the data and parameter of analytical air system.

SystemObject Autodesk.Revit.DB.MechanicalAirSystemData

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AirSystemData : IDisposable
```
```vb
Public Class AirSystemData
	Implements IDisposable
```
```cpp
public ref class AirSystemData : IDisposable
```
```fsharp
type AirSystemData =
    class
        interface IDisposable
    end
```

The AirSystemData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AirFanType | The fan type. |
|  | ChilledWaterLoopId | The chilled water loop used for the chilled water option of cooling coil. |
|  | CoolingCoilType | The cooling coil type. Note this property change would reset the chilled water loop. |
|  | HeatExchangerType | The type of heat exchanger. |
|  | HeatingCoilType | The heating coil type. Note this property change would reset the heating water loop. |
|  | HeatingHotWaterLoopId | The water loop element id for the hot-water heating coil. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | PreheatCoilType | The preheat coil type. Note this property change would reset the preheat water loop. |
|  | PreheatHotWaterLoopId | The water loop element id for the hot-water preheat coil. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the AirSystemData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace